{
  "nav": {
    "experience": "Erfahrung",
    "education": "Ausbildung",
    "top": "Zurück zu Kopf", 
    "about": "Über Mich"
  },

  "home": {
    "subheading": "Student von der Mathematik | Aufstrebender Programmierer | Liebhaber von Espresso"
  },

  "education": {
    "highschool": {
      "timeframe": "Autumn 2014 - Spring 2017",
      "degree": "GED",
      "institution": "Naperville Central High School",
      "location": "Naperville, Illinois, USA"
    },

    "university": {
      "timeframe": "Autumn 2017 - Spring 2022",
      "degree": "Bachelour's of Mathematics",
      "institution": "University of Waterloo",
      "location": "Waterloo, Ontario, Canada",
      "description": "Durch meine Zeit an der Universität von Waterloo soweit bekam ich Erfahrung mit Mathe Logische und Nachweisen, funktionell und imperative Programmierung, und wirksame Kommunikation durch Sprechen und Schreiben."
    }
  },

  "experience": {
    "heading": "Erfahrung",
    "Taco_Hell": {
      "company": "Taco Bell",
      "title": "Service Champion",
      "timeframe": "September 2015 - Dezember 2015",
      "location": "Naperville, Illinois, USA",
      "description": "Hauptkellner und Team Mitglieder "
    },

    "Portillos": {
      "company": "Portillo's Hotdogs",
      "title": "Customer Service Representative",
      "timeframe": "Juni 2018 - August 2018",
      "location": "Bolingbrook, Illinois, USA",
      "description": "Kellner, beide innen und draußen, und Team Mitglieder"
    },

    "Math Ambassador": {
      "company": "University of Waterloo, Faculty of Mathematics",
      "title": "Math Student Ambassador",
      "timeframe": "Oktober 2018 - Heutig",
      "location": "Waterloo, Ontario, Canada",
      "description": "Platzanweiser und Leiter für zukünftigen Studenten von der Fakultät von Mathematik"
    },

    "HHD": {
      "company": "HHD Imports Inc",
      "title": "Assistent von der Administration und Marketing",
      "timeframe": "Mai 2019 - August 2019",
      "location": "Waterloo, Ontario, Canada",
      "description": "Assistent für Dokumentation und Kommunikation für LCBO (Liquor Control Board of Ontario / Büro für die Kontrolle von Alkohol von Ontario), und Marketing für Alkohol Produkten einer Nische"
    }
  },

  "about": {
    "heading": "Über Mich",
    "description": {
      "1":"Hallo! Außer ein Enthusiasmus für Espresso und eine Tenazität für Tee, man könnte sagen, dass ich eine große Neugierigkeit für coding habe; eine Passion für Programmierung (das reicht für Alliteration; das wäre unmöglich überzusetzen). Als ein dritter-Jahre Student an der Universität von Waterloo, ich habe gelernt, die Schritte zu schätzen, die mich hierhin gebracht haben, aus Grand Cayman, nach der Nähe von Toronto, nach der Nähe von Chicago, nach Waterloo. ",
      "2":"Durch meine grundlegende Periode in Illinois habe ich eine Glücklichkeit gefunden, in kreative Aktivitäten: singen, tanzten, Klavier spielen, zeichnen, malen, und (manchmal) schreiben; es gab einfach so viel zu äußern und grenzenlos viel Möglichkeiten zu realisieren. Später habe ich angefangen, Fremdsprachen anzunehmen, und sie benutzen, um andere Kulturen für mich zu entdecken.",
      "3":"Und jetzt ist es hier wo ich stehe, und ehrlich, frage mich was zum Teufel ich mache. Die Straße steht vor mir lange, mühsam, und unbekannte. Ich werde Schritte von Schritte spazieren; ich kann einfach nicht wissen, was vor mir stehen wird, bis es mir direkt in den Gesicht anschlägt. "
    }
  },

  "projects": {
    "heading": "Projekten",
    "Graph GUI Tool": {
      "title": "Graph GUI Tool (unverfasstes Titel)",
      "description": "Ein graphisches Softwarearbeitszeug, beabsichtigt für Studenten von Graph und Neztwerk Theorie, um ihre Verständnis zu verbessern.",
      "language": "C++"
    }
  }
}